""" extended version of first homework """

from math import sqrt

while True:
    choice = input("Введите ваш выбор(номер задания или \"e\"/\"exit\", чтобы завершить работу программы): \n")
    print("=========================================================")

    match choice:

        case "1":
            while True:
                inner_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match inner_choice:
                    case "1":
                        while True:
                            print("Введите ваш список из чисел через пробел: ")
                            try:
                                list_data = [int(value) for value in input().split()]
                                print("Ваш список: ", list_data)
                                print("---------------------------------------------------------")
                                break
                            except:
                                print("*******************************************************")
                                print("Список должен состоять из чисел! Повторите ввод.")
                                print("*******************************************************")
                    case "2":
                        print("=========================================================")
                        break

        case "2":
            while True:
                inner_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match inner_choice:
                    case "1":
                        data = dict()
                        print("Начните вводить словарь. Для остановки ввода словаря введите ключ \"stop\".")
                        while True:
                            key = input('Введите ключ или \"stop\" для остановки ввода словаря: ')
                            if key == "stop":
                                print("-------------------------------------------------------")
                                print("Исходный словарь: ", data)
                                print("-------------------------------------------------------")
                                break
                            value = input('Введите значение: ')
                            data[key] = value
                        while True:
                            my_key = input("Введите ключ для поиска по словарю или \"stop\", чтобы завершить работу с введённым словарём\n")
                            if my_key == "stop":
                                print("=========================================================")
                                break
                            try:
                                print("Значение по введённому ключу: ", data[my_key])
                                print("-------------------------------------------------------")
                            except:
                                print("*******************************************************")
                                print("Такого ключа в словаре нет! Повторите ввод.")
                                print("*******************************************************")
                    case "2":
                        print("=========================================================")
                        break

        case "3":
            while True:
                inner_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match inner_choice:
                    case "1":
                        my_message = input("Введите вашу строку или \"stop\", чтобы завершить работу с данным пунктом:\n")
                        if my_message == "stop":
                            print("=========================================================")
                        else:
                            print("Длина вашей строки: ", len(my_message))
                            print("-------------------------------------------------------")
                    case "2":
                        print("=========================================================")
                        break

        case "4":
            while True:
                inner_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match inner_choice:
                    case "1":
                        try:
                            my_number = int(input("Введите ваше число:\n"))
                            print("Квадратный корень из числа: ", sqrt(my_number))
                            print("-------------------------------------------------------")
                        except:
                            print("*******************************************************")
                            print("Значение должно быть числом! Повторите ввод.")
                            print("*******************************************************")
                    case "2":
                        print("=========================================================")
                        break

        case "5":
            while True:
                inner_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match inner_choice:
                    case "1":
                        while True:
                            try:
                                high_border = int(input("Введите верхнюю границу диапазона: "))
                                my_list = list(range(1, high_border + 1))
                                print("Сумма всех чисел диапазона: ", sum(my_list))
                                print("-------------------------------------------------------")
                                break
                            except:
                                print("*******************************************************")
                                print("Значение должно быть числом! Попробуйте ещё раз.")
                                print("*******************************************************")
                    case "2":
                        print("=========================================================")
                        break

        case "6":
            while True:
                data = dict()
                outer_choice = input(
                    "Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match outer_choice:
                    case "1":
                        while True:
                            key = input('Введите ключ или \"stop\" для остановки ввода: ')
                            if key == "stop":
                                print("Исходный словарь: ", data)
                                print("-------------------------------------------------------")
                                break
                            while True:
                                try:
                                    value = int(input('Введите значение: '))
                                    break
                                except:
                                    print("*******************************************************")
                                    print("Значение должно быть числом! Попробуйте ещё раз.")
                                    print("*******************************************************")
                            data[key] = value
                        while True:
                            inner_choice = input("Выберите опцию: \n1) Выполнить произведение двух значений по ключам \n2) Завершить работу с данным словарём\n")
                            match inner_choice:
                                case "1":
                                    while True:
                                        key_1 = input("Введите первый ключ: ")
                                        if key_1 in data.keys():
                                            break
                                        else:
                                            print("*******************************************************")
                                            print("Такого ключа в словаре нет! Попробуйте ещё раз.")
                                            print("*******************************************************")
                                    while True:
                                        key_2 = input("Введите второй ключ: ")
                                        if key_2 in data.keys():
                                            break
                                        else:
                                            print("*******************************************************")
                                            print("Такого ключа в словаре нет! Попробуйте ещё раз.")
                                            print("*******************************************************")
                                    print("Результат произведения: ", data[key_1] * data[key_2])
                                    print("-------------------------------------------------------")
                                case "2":
                                    print("-------------------------------------------------------")
                                    break
                    case "2":
                        print("=========================================================")
                        break

        case "7":
            while True:
                outer_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match outer_choice:
                    case "1":
                        my_message = input("Введите строку: ")
                        while True:
                            inner_choice = input("Введите количество элементов с начала строки, которое нужно вывести или \"stop\", чтобы завершить работу с данной строкой: ")
                            if inner_choice == "stop":
                                print("=========================================================")
                                break
                            try:
                                length = int(inner_choice)
                                if length > len(my_message):
                                    print("*******************************************************")
                                    print("Введённое количество больше длины строки! Повторите ввод.")
                                    print("*******************************************************")
                                else:
                                    print(my_message[:length])
                                    print("-------------------------------------------------------")
                            except:
                                print("*******************************************************")
                                print("Неверное значение! Повторите ввод.")
                                print("*******************************************************")
                    case "2":
                        print("=========================================================")
                        break

        case "8":
            while True:
                outer_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match outer_choice:
                    case "1":
                        while True:
                            print("Введите ваш список через пробел: ")
                            try:
                                list_data = [int(value) for value in input().split()]
                                print("Ваш список: ", list_data)
                                break
                            except:
                                print("*******************************************************")
                                print("В списке присутствует хотя бы одно неверное значение(не число)! Повторите ввод.")
                                print("*******************************************************")
                        while True:
                            inner_choice = input(
                                "Выберите опцию: \n1) Выполнить деление элементов списка на число \n2) Завершить работу с данным списком\n")
                            match inner_choice:
                                case "1":
                                    while True:
                                        divider = input("Введите делитель: ")
                                        try:
                                            for index in range(len(list_data)):
                                                list_data[index] = list_data[index] % int(divider)
                                            print("Результат: ", list_data)
                                            print("-------------------------------------------------------")
                                            break
                                        except:
                                                print("*******************************************************")
                                                print("Неверное значение(не число)! Повторите ввод.")
                                                print("*******************************************************")
                                case "2":
                                    print("-------------------------------------------------------")
                                    break

                    case "2":
                        print("=========================================================")
                        break

        case "9":
            while True:
                outer_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match outer_choice:
                    case "1":
                        data = dict()
                        print("Начните вводить словарь. Для остановки ввода введите ключ \"stop\".")
                        while True:
                            key = input('Введите ключ или \"stop\" для остановки ввода: ')
                            if key == "stop":
                                print("Исходный словарь: ", data)
                                print("-------------------------------------------------------")
                                break
                            while True:
                                try:
                                    value = int(input('Введите значение: '))
                                    break
                                except:
                                    print("*******************************************************")
                                    print("Значение должно быть числом! Попробуйте ещё раз.")
                                    print("*******************************************************")
                            data[key] = value
                        while True:
                            inner_choice = input("Выберите опцию: \n1) Выполнить деление нацело значений по ключу \n2) Завершить работу с данным словарём\n")
                            match inner_choice:
                                case "1":
                                    while True:
                                        key_1 = input("Введите ключ делимого: ")
                                        if key_1 in data.keys():
                                            break
                                        else:
                                            print("*******************************************************")
                                            print("Такого ключа в словаре нет! Попробуйте ещё раз.")
                                            print("*******************************************************")
                                    while True:
                                        key_2 = input("Введите ключ делителя: ")
                                        if key_2 in data.keys():
                                            break
                                        else:
                                            print("*******************************************************")
                                            print("Такого ключа в словаре нет! Попробуйте ещё раз.")
                                            print("*******************************************************")
                                    print("Результат деления: ", data[key_1] // data[key_2])
                                    print("-------------------------------------------------------")
                                case "2":
                                    print("-------------------------------------------------------")
                                    break
                    case "2":
                        print("=========================================================")
                        break

        case "10":
            print("Технические шоколадки условия =)")
            print("=========================================================")

        case "11":
            while True:
                inner_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match inner_choice:
                    case "1":
                        data = dict()
                        print("Начните вводить внешний словарь. Для остановки ввода введите ключ \"stop\".")
                        while True:
                            key = input('Введите ключ или \"stop\" для остановки ввода: ')
                            if key == "stop":
                                print("-------------------------------------------------------")
                                print("Исходный словарь: ", data)
                                print("-------------------------------------------------------")
                                break
                            print("Введите элемент словаря(список через пробел):")
                            list_value = [value for value in input().split()]
                            data[key] = list_value
                        while True:
                            my_key = input("Введите ключ для поиска по словарю или \"stop\", чтобы завершить работу с данным словарём\n")
                            if my_key == "stop":
                                print("-------------------------------------------------------")
                                break
                            try:
                                print("Значение по введённому ключу: ", data[my_key])
                                print("-------------------------------------------------------")
                            except:
                                print("*******************************************************")
                                print("Такого ключа в словаре нет! Повторите ввод.")
                                print("*******************************************************")
                    case "2":
                        print("=========================================================")
                        break

        case "12":
            while True:
                outer_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match outer_choice:
                    case "1":
                        data = dict()
                        print("Начните вводить словарь. Для остановки ввода введите ключ \"stop\".")          #
                        while True:
                            key = input('Введите первый/следующий ключ или \"stop\" для остановки ввода ВНЕШНЕГО словаря: ')
                            if key == "stop":
                                print("Исходный словарь: ", data)
                                print("-------------------------------------------------------")
                                break
                            inner_data = dict()
                            print("-------------------------------------------------------")
                            print("Введите первый/следующий элемент основного словаря(ВЛОЖЕННЫЙ СЛОВАРЬ)")
                            while True:
                                inner_key = input('Введите первый/следующий ключ или \"stop\" для остановки ввода вложенного словаря: ')
                                if inner_key == "stop":
                                    print("-------------------------------------------------------")
                                    break
                                inner_value = input('Введите значение: ')
                                inner_data[inner_key] = inner_value
                            data[key] = inner_data
                        while True:
                            inner_choice = input("Выберите опцию: \n1) Выполнить поиск значение по ключам \n2) Завершить работу с данным словарём\n")
                            match inner_choice:
                                case "1":
                                    while True:
                                        search_outer_key = input("Введите ключ по которому будет производиться поиск во ВНЕШНЕМ словаре(по сути, выберите в каком из вложенных словарей будет дальнейший поиск), или введите ключ \"stop\", чтобы завершить работу с данным словарём: ")
                                        if search_outer_key == "stop":
                                            print("-------------------------------------------------------")
                                            break
                                        if search_outer_key in data.keys():
                                            while True:
                                                search_inner_key = input(
                                                    "Введите ключ по которому будет производиться поиск во ВЛОЖЕННОМ списке, или \"stop\", чтобы завершить работу с данным вложенным словарём и вернуться к выбору вложенного словаря: ")
                                                if search_inner_key == "stop":
                                                    print("-------------------------------------------------------")
                                                    break
                                                if search_inner_key in data[search_outer_key].keys():
                                                    print("Значение из заданного вложенного списка по заданному ключу: ", data[search_outer_key][search_inner_key])
                                                    print("-------------------------------------------------------")
                                                else:
                                                    print("*******************************************************")
                                                    print("Такого ключа в словаре нет! Попробуйте ещё раз.")
                                                    print("*******************************************************")
                                        else:
                                            print("*******************************************************")
                                            print("Такого ключа в словаре нет! Попробуйте ещё раз.")
                                            print("*******************************************************")
                                case "2":
                                    print("-------------------------------------------------------")
                                    break
                    case "2":
                        print("=========================================================")
                        break

        case "13":
            print("Задания 12 и 13 аналогичны, выберите задание 12!")
            print("=========================================================")
            break

        case "14":
            while True:
                inner_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match inner_choice:
                    case "1":
                        player_info = {}
                        print("Введите данные игрока:")
                        name = input("Имя игрока: ")
                        player_info["name"] = name
                        while True:
                            print("Введите список значений счёта игрока через пробел: ")
                            try:
                                score_list = [int(value) for value in input().split()]
                                break
                            except:
                                print("*******************************************************")
                                print("В списке присутствует хотя бы одно неверное значение(не число)! Повторите ввод.")
                                print("*******************************************************")
                        player_info["scores"] = score_list
                        print(player_info)
                        print("Средний счёт игрока: ", sum(player_info["scores"]) / len(player_info["scores"]))
                        print("-------------------------------------------------------")
                    case "2":
                        print("=========================================================")
                        break

        case "15":
            while True:
                inner_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match inner_choice:
                    case "1":
                        hlwrld_list= []
                        hlwrld_list.append(input("Введите первый элемент списка - строку: "))
                        inner_dict = dict()
                        print("Начните вводить вложенный словарь. Для остановки ввода введите ключ \"stop\".")
                        while True:
                            key = input('Введите ключ или \"stop\" для остановки ввода: ')
                            if key == "stop":
                                print("-------------------------------------------------------")
                                break
                            value = input("Введите значение: ")
                            inner_dict[key] = value
                        hlwrld_list.append(inner_dict)
                        print(hlwrld_list)
                        while True:
                            search_key = input("Введите ключ для поиска во вложенном словаре, или \"stop\", чтобы закончить работу с этим словарём: ")
                            if search_key == "stop":
                                print("-------------------------------------------------------")
                                break
                            if search_key in inner_dict.keys():
                                print("Искомое значение: ", hlwrld_list[1][search_key])
                                print("-------------------------------------------------------")
                            else:
                                print("*******************************************************")
                                print("Такого ключа в словаре нет! Попробуйте ещё раз.")
                                print("*******************************************************")
                    case "2":
                        print("=========================================================")
                        break

        case "16":
            while True:
                inner_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match inner_choice:
                    case "1":
                        hlwrld_list = []
                        while True:
                            try:
                                hlwrld_list.append(int(input("Введите первый элемент списка - число: ")))
                                break
                            except:
                                print("*******************************************************")
                                print("Неверное значение! Повторите ввод.")
                                print("*******************************************************")
                        hlwrld_list.append(input("Введите второй элемент списка - строку: "))
                        inner_dict = dict()
                        print("Начните вводить третий элемент списка - вложенный словарь. Для остановки ввода введите ключ \"stop\".")
                        while True:
                            key = input('Введите ключ или \"stop\" для остановки ввода: ')
                            if key == "stop":
                                print("-------------------------------------------------------")
                                break
                            while True:
                                try:
                                    value = int(input('Введите значение: '))
                                    break
                                except:
                                    print("*******************************************************")
                                    print("Значение должно быть числом! Попробуйте ещё раз.")
                                    print("*******************************************************")
                            inner_dict[key] = value
                        hlwrld_list.append(inner_dict)
                        print("Исходный список: ", hlwrld_list)
                        print("-------------------------------------------------------")
                        while True:
                            search_key = input("Введите ключ для взятия значение из вложенного списка, или \"stop\", чтобы завершить работу с данным списком: ")
                            if search_key == "stop":
                                print("-------------------------------------------------------")
                                break
                            if search_key in inner_dict.keys():
                                print("Результат произведения в соответствии с заданием: ", hlwrld_list[0] * hlwrld_list[2][search_key])
                                print("-------------------------------------------------------")
                            else:
                                print("*******************************************************")
                                print("Такого ключа нет! Повторите ввод.")
                                print("*******************************************************")
                    case "2":
                        print("=========================================================")
                        break

        case "17":
            while True:
                inner_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match inner_choice:
                    case "1":
                        hlwrld_list = []
                        while True:
                            try:
                                hlwrld_list.append(int(input("Введите первый элемент списка - число: ")))
                                break
                            except:
                                print("*******************************************************")
                                print("Неверное значение! Повторите ввод.")
                                print("*******************************************************")
                        hlwrld_list.append(input("Введите второй элемент списка - строку: "))
                        inner_dict = dict()
                        print(
                            "Начните вводить третий элемент списка - вложенный словарь. Для остановки ввода введите ключ \"stop\".")
                        while True:
                            key = input('введите ключ или \"stop\" для остановки ввода: ')
                            if key == "stop":
                                print("-------------------------------------------------------")
                                break
                            value = input('введите значение: ')
                            inner_dict[key] = value
                        hlwrld_list.append(inner_dict)
                        while True:
                            try:
                                print("Введите четвёртый элемент списка через пробел - список: ")
                                list_data = [int(value) for value in input().split()]
                                print("-------------------------------------------------------")
                                break
                            except:
                                print("*******************************************************")
                                print("В списке есть хотя бы одно неверное значение(не число)! Повторите ввод.")
                                print("*******************************************************")
                        hlwrld_list.append(list_data)
                        print("Исходный список: ", hlwrld_list)
                        print("-------------------------------------------------------")
                        while True:
                            print("Введите ключ и значение который нужно добавить во вложенный словарь, или ключ \"stop\", чтобы завершить добавление элементов ")
                            new_key = input("Введите новый ключ или \"stop\", чтобы завершить добавление: ")
                            if new_key == "stop":
                                break
                            if new_key == '':
                                continue
                            new_value = input("Введите новое значение: ")
                            hlwrld_list[2][new_key] = new_value
                        while True:
                            print("Введите новое значение для добавления во вложенный список или \"stop\", чтобы завершить добавление элементов")
                            new_list_value = input("Введите значение: ")
                            if new_list_value == "stop":
                                print("-------------------------------------------------------")
                                break
                            try:
                                hlwrld_list[3].append(int(new_list_value))
                            except:
                                print("*******************************************************")
                                print("Значение должно быть числом! Повторите ввод.")
                                print("*******************************************************")
                        print("-------------------------------------------------------")
                        print("Итоговый список: ", hlwrld_list)
                        print("-------------------------------------------------------")
                    case "2":
                        print("=========================================================")
                        break

        case "18":
            while True:
                inner_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match inner_choice:
                    case "1":
                        print("ФОРМИРОВАНИЕ СТРУКТУРЫ")
                        person_profile = dict()
                        person_name = input("Введите имя: ")
                        person_profile["name"] = person_name
                        person_profile["info"] = dict()
                        while True:
                            try:
                                person_profile["info"]["age"] = int(input("Введите возраст: "))
                                break
                            except:
                                print("*******************************************************")
                                print("Значение должно быть числом! Повторите ввод.")
                                print("*******************************************************")
                        person_profile["info"]["city"] = input("Введите город: ")
                        person_profile["info"]["hobbies"] = [hobby for hobby in input("Через запятую и пробел (, ) введите список хобби: ").split(', ')]
                        length = len(person_profile["info"]["hobbies"])
                        print("-------------------------------------------------------")
                        print("Исходный словарь: ", person_profile)
                        print("-------------------------------------------------------")
                        while True:
                            print("Введите номер хобби в списке от 1 до", length, "или \"stop\", чтобы завершить поиск: ")
                            hobby_number = input()
                            if hobby_number == "stop":
                                print("-------------------------------------------------------")
                                break
                            try:
                                hobby_number = int(hobby_number)
                            except:
                                print("*******************************************************")
                                print("Неверное значение! Повторите ввод.")
                                print("*******************************************************")
                                continue
                            if hobby_number < 1 or hobby_number > length:
                                print("*******************************************************")
                                print("Неверное значение! Повторите ввод.")
                                print("*******************************************************")
                                continue
                            else:
                                print("Искомое значение: ", person_profile["info"]["hobbies"][hobby_number - 1])
                                print("-------------------------------------------------------")
                    case "2":
                        print("=========================================================")
                        break

        case "19":
            while True:
                inner_choice = input("Выберите опцию:\n1) Запустить данный пункт \n2) Завершить работу с данным пунктом и вернуться к выбору задания\n")
                match inner_choice:
                    case "1":
                        print("ФОРМИРОВАНИЕ СТРУКТУРЫ")
                        person_profile = dict()
                        person_name = input("Введите имя: ")
                        person_profile["name"] = person_name
                        person_profile["friends"] = []
                        while True:
                            try:
                                friends_amount = int(input("Введите количество друзей данного человека: "))
                                print("-------------------------------------------------------")
                                break
                            except:
                                print("*******************************************************")
                                print("Значение должно быть числом! Повторите ввод.")
                                print("*******************************************************")
                        for index in range(friends_amount):
                            friend = dict()
                            # person_profile["friends"][index] = dict()
                            friend["name"] = input("Введите имя друга: ")
                            while True:
                                try:
                                    friend["age"] = int(input("Введите возраст друга: "))
                                    break
                                except:
                                    print("*******************************************************")
                                    print("Значение должно быть числом! Повторите ввод.")
                                    print("*******************************************************")
                            person_profile["friends"].append(friend)
                        print("-------------------------------------------------------")
                        print("Исходная информация профиля человека: ", person_profile)
                        print("-------------------------------------------------------")
                        while True:
                            print("Введите номер друга в списке от 1 до", len(person_profile["friends"]), "или \"stop\", чтобы завершить поиск: ")
                            friend_number = input()
                            if friend_number == "stop":
                                print("-------------------------------------------------------")
                                break
                            try:
                                friend_number = int(friend_number)
                            except:
                                print("*******************************************************")
                                print("Неверное значение! Повторите ввод.")
                                print("*******************************************************")
                                continue
                            if friend_number < 1 or friend_number > len(person_profile["friends"]):
                                print("*******************************************************")
                                print("Неверное значение! Повторите ввод.")
                                print("*******************************************************")
                                continue
                            else:
                                print("Имя друга: ", person_profile["friends"][friend_number - 1]["name"], "\nВозраст друга: ", person_profile["friends"][friend_number - 1]["age"])
                                print("-------------------------------------------------------")
                    case "2":
                        print("=========================================================")
                        break

        case "e":
            break

        case "exit":
            break


