# task_1

colors = ["red", "green", "blue"]
print("1) Список с именами цветов:", colors)
print("--------------------------------------------------")


# ==============================================
# task_2

test_dictionary = {
    "name": "Slava",
    "age": 19,
    "city": "Minsk"}

print("2) Значение по ключу \"city\":", test_dictionary["city"])
print("--------------------------------------------------")


# ==============================================
# task_3

greetings = "Привет, мир!"
print("3) Длина строки", len(greetings))
print("--------------------------------------------------")


# ==============================================
# task_4

test_number = 42
print("4) Корень из числа 42:", test_number ** 0.5)
print("--------------------------------------------------")


# ==============================================
# task_5

numbers_list = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print("5) Сумма элементов списка:", sum(numbers_list))
print("--------------------------------------------------")


# ==============================================
# task_6

abc_dict = {"a": 1, "b": 2, "c": 3}
print("6) Произведение значений по ключам a и c:", abc_dict["a"] * abc_dict["c"])
print("--------------------------------------------------")


# ==============================================
# task_7

true_statement = "Python это интересный язык программирования"
print("7) Первые 5 символов строки:", true_statement[:5])
print("--------------------------------------------------")


# ==============================================
# task_8(возможно я забыл какой-то очень простой метод для списков, чтобы весь список сразу на число поделить
# буду благодарен, если напомните, потому что хоть убейте как ни вспоминал и как не искал не нашёл ничего проще цикла или вот
# этого:)


numbers = [12, 15, 18, 21,  24]
print(*numbers)
print("8):", numbers[0] % 5, numbers[1] % 5, numbers[2] % 5, numbers[3] % 5, numbers[4] % 5)
print("--------------------------------------------------")


# ==============================================
# task_9

xyz_dict = {"x": 10, "y": 20, "z": 30}


# ==============================================
# task_10

print("9) и 10):", xyz_dict["z"] // xyz_dict["x"])
print("--------------------------------------------------")


# ==============================================
# task_11

fruits_list = ["Orange", "Apple", "Banana"]
test_dictionary = {"fruits": fruits_list}
print("11) Значение по ключу \"fruits\":", test_dictionary["fruits"])
print("--------------------------------------------------")


# ==============================================
# task_12

profile_info = {"name": "Slava", "age": 19}
person = {"person": profile_info}
print("12) Значение по ключу \"age\" из вложенного словаря:", person["person"]["age"])
print("--------------------------------------------------")


# ==============================================
# task_13

profile_info = {"name": "Slava", "hobby": "martial arts"}
person = {"person": profile_info}
print("13) Значение по ключу \"hobby\" из вложенного словаря:", person["person"]["hobby"])
print("--------------------------------------------------")


# ==============================================
# task_14

person = {"name": "Slava", "scores": [34, 45, 13]}
print("14) Среднее арифметическое:", sum(person["scores"]) / 3)
print("--------------------------------------------------")


# ==============================================
# task_15

test_list = ["Hello", {"world": 1, "!": 2}]
print("15) Значение по ключу \"!\":", test_list[1]["!"])
print("--------------------------------------------------")


# ==============================================
# task_16

test_list = [10, "Hello", {"a": 3, "b": 4}]
print("16) Cумма:", test_list[0] + test_list[2]["a"])
print("--------------------------------------------------")


# ==============================================
# task_17

test_list = [5, "World", {"a": 6, "b": 7}, [8, 9]]
test_list[2]["new"] = 223
test_list[3].append(10)
print("17) Выводить в задании не написано, но пусть будет:", test_list)
print("--------------------------------------------------")


# ==============================================
# task_18

profile_info = {
    "name": "Slava",
    "info": {
        "age": 19,
        "city": "Minsk",
        "hobbies": ["martial arts", "reading", "basketball"]
    }
}
print("18)\"hobbies\" полностью:", profile_info["info"]["hobbies"], "\nТолько вторая строка:", profile_info["info"]["hobbies"][1])
print("--------------------------------------------------")


# ==============================================
# task_19

profile_info = {
    "name": "Slava",
    "friends": [
        {
            "name": "Vanya",
            "age": 20
        },
        {
            "name": "Max",
            "age": 18
        },
        {
            "name": "Yarik",
            "age": 18
        }
    ]
}
print("19) Имя:", profile_info["friends"][0]["name"], "  |   Возраст:", profile_info["friends"][0]["age"])












