print("Сумма трёх чисел")
print("------------------------------------------------------")
term_1 = int(input("Введите первое слагаемое: "))
term_2 = int(input("Введите второе слагаемое: "))
term_3 = int(input("Введите третье слагаемое: "))
print("Сумма трёх: ", term_1 + term_2 + term_3)
print("======================================================")


print("Следующее и предыдущее")
print("------------------------------------------------------")
current_value = int(input("Введите значение: "))
print("Следующее за числом", current_value, "число:", current_value + 1)
print("Для числа", current_value, "предыдущее число:", current_value - 1)
print("======================================================")


print("Расстояние в метрах")
print("------------------------------------------------------")
cm_value = int(input("Введите расстояние в сантиметрах: "))
print("Расстояние в метрах: ", cm_value // 100, "метров")
print("======================================================")


print("Пересчёт временного интервала: ")
print("------------------------------------------------------")
min_value = int(input("Введите временной интервал в минутах: "))
print(min_value, "минут -- это", min_value // 60, "час(а)/(ов)", min_value - min_value // 60 * 60, "минут(ы)")
print("======================================================")


print("Трёхзначное число")
print("------------------------------------------------------")
three_digit = input("Введите трёхзначное число: ")
print("Сумма цифр: ", int(three_digit[0]) + int(three_digit[1]) + int(three_digit[2]))
print("Произведение цифр: ", int(three_digit[0]) * int(three_digit[1]) * int(three_digit[2]))
print("======================================================")


print("Чётное или нечётное?")
print("------------------------------------------------------")
value = int(input(("Введите число: ")))
print("Чётное?", (bool((value + 1) % 2)))
print("======================================================")


print("Квадрат")
print("------------------------------------------------------")
side = int(input("Введите сторону квадрата: "))
print("Периметр квадрата:", side * 4)
print("Площадь квадрата:", side ** 2)
print("Диагональ квадрата:", side * (2 ** 0.5))
print("======================================================")


print("Списки")
print("------------------------------------------------------")
list = []
list.append(input("Первый элемент исходного списка: "))
list.append(input("Второй элемент исходного списка: "))
list.append(input("Третий элемент исходного списка: "))
print("Исходный список: ", list)
list.append(input("Элемент типа str в конец списка: "))
list.insert(0, int(input("Элемент типа int на первое место списка: ")))
new_list = []
list.append(new_list)
new_tuple = ()
list.insert(2, new_tuple)
list.pop(0)
print("Итоговый список: ", list)
print("======================================================")
